
/**
 * Задание № 3
 *
 * 1) Написать алгоритм проверки необходимости человеку работать. Функция имеет
 * два параметра: - isWeekDay показывает это рабочий день (true) или
 * выходной(false) - isHoliday показывает нахожусь ли я в отпуске true) или
 * нет(false)
 *
 * Задание: - если человек в отпуске или сейчас выходной день, то вывести в
 * консоль сообщение "Отдыхай" - иначе вывести сообщение "Давай работай" Вывод
 * сообщения произвести в консоль
 */
public class Task3 {

    public static void checkHoliday(boolean isWeekDay, boolean isHoliday) {
        /**
         * NOTE! Тут ошибка в решении. По заданию, если я в отпуске или у меня
         * выходной день, то я должен увидеть только одно сообщение. А у тебя
         * выведится 2. Тут нужно написать один if-else с логическими
         * операторами.
         */

        if (isWeekDay == false || isHoliday == true) {
            System.out.println("Отдыхай");
        } else {
            System.out.println("Работай");
        }
    }

    public static void main(String[] args) {
        // вызвать функцию здесь
        checkHoliday(true, false);
    }
}
