package HomeWork6_2.Converter;

import HomeWork6_2.ConversionDegree;

public class Fahrenheit implements ConversionDegree {

    /**
     * NOTE! Вообще суть задания была в том, что нужно создать несколько классов
     * и подключить к ним интерфейс.
     *
     * Смотри, если мне сейчас придется добавить еще какие-то конвертации, то
     * мне придется расширять логику этого класса. Представь что будет если я
     * добавлю сюда 100 конвертеров? Как ты сможещь это релизовать в рамках
     * одного класса?
     * 
     * можно было бы и в рамках одного класса и много методов, если методы были бы по 3 строчки!
     */
    @Override
    public void transfer(double far) {
        far = far * 1.8 + 32;
        System.out.println(far + "°F");
    }
}
